[
    {
        "table_name": "actor",
        "summary": "Storage for actor information (first name, last name). Use to identify actors in films."
    },
    {
        "table_name": "address",
        "summary": "Address details for customers, staff, and stores. Contains street, district, and phone."
    },
    {
        "table_name": "category",
        "summary": "Film categories (genres) like Action, Comedy, Horror. Use to classify films."
    },
    {
        "table_name": "city",
        "summary": "City names and their associated country_id. Part of the address hierarchy."
    },
    {
        "table_name": "country",
        "summary": "Country names. Top level of the address hierarchy."
    },
    {
        "table_name": "customer",
        "summary": "Primary user/customer table. Contains profiles, email, active status, and address linkage. Use for ranking customers or filtering by status."
    },
    {
        "table_name": "film",
        "summary": "Main catalog of films/movies. Contains title, description, release year, rating (G, PG, etc.), rental details, and length."
    },
    {
        "table_name": "film_actor",
        "summary": "Junction table linking Films to Actors. Use to find which actors played in which film."
    },
    {
        "table_name": "film_category",
        "summary": "Junction table linking Films to Categories. Use to filter films by genre."
    },
    {
        "table_name": "inventory",
        "summary": "Physical inventory of film copies at specific stores. Links Films to Stores. Essential for rental availability."
    },
    {
        "table_name": "language",
        "summary": "Spoken languages for films."
    },
    {
        "table_name": "payment",
        "summary": "Financial transactions. Records payments made by customers for rentals. Contains amount and payment_date. Use for calculating revenue or spending."
    },
    {
        "table_name": "rental",
        "summary": "Rental history. Records when a customer rented an inventory item and when it was returned. Links Customer, Inventory, and Staff."
    },
    {
        "table_name": "staff",
        "summary": "Employee information. Links staff to specific stores."
    },
    {
        "table_name": "store",
        "summary": "Physical store locations. Links address and manager (staff)."
    }
]
